## Panda Series

In [5]:
import pandas as pd

In [49]:
name_age = {"alan" : 29, "joyce" : 30, "jonn" : 30 , "lili" : 30, "ram" : 40, "jon" : 40, "lucy" : 40, }

In [50]:
name_age

{'alan': 29,
 'joyce': 30,
 'jonn': 30,
 'lili': 30,
 'ram': 40,
 'jon': 40,
 'lucy': 40}

In [44]:
pd.Series(name_age) #input shift + tab to open up the help page. One-dimensional ndarray with axis labels (including time series).

alan     29
joyce    30
jon      40
lili     30
ram      40
lucy     40
dtype: int64

### Need to give this a value because we're treating this as a series

In [53]:
name_age_s = pd.Series(name_age)

In [52]:
name_age_s.index

Index(['alan', 'joyce', 'jon', 'lili', 'ram', 'lucy'], dtype='object')

In [54]:
(pd.Series(name_age)).index

Index(['alan', 'joyce', 'jonn', 'lili', 'ram', 'jon', 'lucy'], dtype='object')

In [39]:
name_age_s <30 #this only shows boolean

alan      True
joyce    False
jon      False
lili     False
ram      False
lucy     False
dtype: bool

In [40]:
name_age_s[name_age_s <30] #do this if you need to show the full details

alan    29
dtype: int64

### Describe the count, mean, std, min, max, quartiles

Quick way to find outliers, extreme values etc. Descriptive statistics

In [41]:
name_age_s.describe()

count     6.000000
mean     34.833333
std       5.671567
min      29.000000
25%      30.000000
50%      35.000000
75%      40.000000
max      40.000000
dtype: float64

In [27]:
name_age_s.mean()

35.8

In [28]:
name_age_s.median()

40.0

In [55]:
name_age_s.mode()

0    30
1    40
dtype: int64

In [57]:
name_age_s.value_counts()

30    3
40    3
29    1
dtype: int64

In [58]:
name_age_s.value_counts(ascending=True)

29    1
30    3
40    3
dtype: int64

In [59]:
name_age_s.value_counts()/name_age_s.shape[0]

30    0.428571
40    0.428571
29    0.142857
dtype: float64

In [60]:
name_age_s.value_counts(normalize=True)

30    0.428571
40    0.428571
29    0.142857
dtype: float64

In [61]:
(name_age_s.value_counts(normalize=True))*100 #converts into a percentage

30    42.857143
40    42.857143
29    14.285714
dtype: float64

## Pandas Dataframe

In [38]:
df = pd.DataFrame({ 'col1': [ "item1", "item2", "item3", "item4","item5"], 
                   'col2':[23,25,28,32,43],
                   'col3':[99,43,87,67,34],
                   'col4':[10,20,30,40,50]},
                   index = ['i1','i2','i3','i4','i5'])

In [66]:
type(df)

pandas.core.frame.DataFrame

In [44]:
print(df)

     col1  col2  col3  col4
i1  item1    23    99    10
i2  item2    25    43    20
i3  item3    28    87    30
i4  item4    32    67    40
i5  item5    43    34    50

In [83]:
df.iloc [ 2:5, 0 : 4  ]

     col1  col2  col3  col4
i3  item3    28    87    30
i4  item4    32    67    40
i5  item5    43    34    50

In [77]:
df.loc[ "i3":"i5",  :  ]

     col1  col2  col3  col4
i3  item3    28    87    30
i4  item4    32    67    40
i5  item5    43    34    50

In [74]:
df.loc[["i2", "i4"], ]

     col1  col2  col3  col4
i2  item2    25    43    20
i4  item4    32    67    40

In [76]:
df.iloc[ [1,3], ]

     col1  col2  col3  col4
i2  item2    25    43    20
i4  item4    32    67    40

In [67]:
df.loc[["i2", "i4"], ["col2", "col4"]]

    col2  col4
i2    25    20
i4    32    40

In [ ]:
df.loc[ :,["col2", "col3", "col4"]]

    col2  col3  col4
i1    23    99    10
i2    25    43    20
i3    28    87    30
i4    32    67    40
i5    43    34    50

In [62]:
df.iloc[:, 1:4]

    col2  col3  col4
i1    23    99    10
i2    25    43    20
i3    28    87    30
i4    32    67    40
i5    43    34    50

In [66]:
df.iloc[[0,4]]

     col1  col2  col3  col4
i1  item1    23    99    10
i5  item5    43    34    50

In [54]:
df.iloc[1:4, 1:3]

    col2  col3
i2    25    43
i3    28    87
i4    32    67

In [40]:
df.col1

i1    item1
i2    item2
i3    item3
i4    item4
i5    item5
Name: col1, dtype: object

In [71]:
type(df.col1) # each column is a series

pandas.core.series.Series

In [72]:
df.col1.describe()

count         5
unique        5
top       item1
freq          1
Name: col1, dtype: object

In [39]:
df['col2']

i1    23
i2    25
i3    28
i4    32
i5    43
Name: col2, dtype: int64

In [74]:
df[['col2']]

    col2
i1    23
i2    25
i3    28
i4    32
i5    43

In [78]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, i1 to i5
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   col1    5 non-null      object
 1   col2    5 non-null      int64
 2   col3    5 non-null      int64
 3   col4    5 non-null      int64
dtypes: int64(3), object(1)
memory usage: 372.0+ bytes

In [79]:
df.columns

Index(['col1', 'col2', 'col3', 'col4'], dtype='object')

In [80]:
df.describe()

            col2       col3       col4
count   5.000000   5.000000   5.000000
mean   30.200000  66.000000  30.000000
std     7.918333  27.766887  15.811388
min    23.000000  34.000000  10.000000
25%    25.000000  43.000000  20.000000
50%    28.000000  67.000000  30.000000
75%    32.000000  87.000000  40.000000
max    43.000000  99.000000  50.000000

In [82]:
df.describe(include='object') # include='object' - only the categorical columns should be included in the summary.

         col1
count       5
unique      5
top     item1
freq        1

In [83]:
df.head()

     col1  col2  col3  col4
i1  item1    23    99    10
i2  item2    25    43    20
i3  item3    28    87    30
i4  item4    32    67    40
i5  item5    43    34    50

In [85]:
df.tail()

     col1  col2  col3  col4
i1  item1    23    99    10
i2  item2    25    43    20
i3  item3    28    87    30
i4  item4    32    67    40
i5  item5    43    34    50

### Subset Dataframe

.loc - to subset the dataframe based on row/col labels

.iloc - to subset the dataframe based in row/col integer index values

In [86]:
df.loc['i1',]

col1    item1
col2       23
col3       99
col4       10
Name: i1, dtype: object

In [84]:
df.loc[['i1'], : ]

     col1  col2  col3  col4
i1  item1    23    99    10

In [88]:
df.loc[['i1','i3'],['col2','col4']]

    col2  col4
i1    23    10
i3    28    30

In [89]:
df.iloc[[0,2],[1,3]] # row , column

    col2  col4
i1    23    10
i3    28    30

In [90]:
df.col2>30

i1    False
i2    False
i3    False
i4     True
i5     True
Name: col2, dtype: bool

In [86]:
df.loc[df.col2>30, : ] #the right is blank because i want to specifiy all the columns

     col1  col2  col3  col4
i4  item4    32    67    40
i5  item5    43    34    50

In [92]:
df.loc[df.col2>30, : ] #or you can add a colon for best practice

     col1  col2  col3  col4
i4  item4    32    67    40
i5  item5    43    34    50

In [41]:
df

     col1  col2  col3  col4
i1  item1    23    99    10
i2  item2    25    43    20
i3  item3    28    87    30
i4  item4    32    67    40
i5  item5    43    34    50

In [42]:
df.loc[ :, ["col1", "col2", "col3", "col4"]]

     col1  col2  col3  col4
i1  item1    23    99    10
i2  item2    25    43    20
i3  item3    28    87    30
i4  item4    32    67    40
i5  item5    43    34    50

In [106]:
df.iloc[:,1:]

    col2  col3  col4
i1    23    99    10
i2    25    43    20
i3    28    87    30
i4    32    67    40
i5    43    34    50

In [107]:
df.iloc[0:6, 1:4]

    col2  col3  col4
i1    23    99    10
i2    25    43    20
i3    28    87    30
i4    32    67    40
i5    43    34    50

In [109]:
df.select_dtypes(exclude='object')

    col2  col3  col4
i1    23    99    10
i2    25    43    20
i3    28    87    30
i4    32    67    40
i5    43    34    50

In [110]:
df.select_dtypes(include='object')

     col1
i1  item1
i2  item2
i3  item3
i4  item4
i5  item5

In [7]:
df3 = pd.read_excel("/Users/mac/Desktop/RISE BCG/Python/titanic.xls")
print(df3)

      pclass  survived                                             name  \
0          1         1                    Allen, Miss. Elisabeth Walton
1          1         1                   Allison, Master. Hudson Trevor
2          1         0                     Allison, Miss. Helen Loraine
3          1         0             Allison, Mr. Hudson Joshua Creighton
4          1         0  Allison, Mrs. Hudson J C (Bessie Waldo Daniels)
...      ...       ...                                              ...
1304       3         0                             Zabour, Miss. Hileni
1305       3         0                            Zabour, Miss. Thamine
1306       3         0                        Zakarian, Mr. Mapriededer
1307       3         0                              Zakarian, Mr. Ortin
1308       3         0                               Zimmerman, Mr. Leo

         sex      age  sibsp  parch  ticket      fare    cabin embarked boat  \
0     female  29.0000      0      0   24160  211.3375       B5        S    2
1       male   0.9167      1      2  113781  151.5500  C22 C26        S   11
2     female   2.0000      1      2  113781  151.5500  C22 C26        S  NaN
3       male  30.0000      1      2  113781  151.5500  C22 C26        S  NaN
4     female  25.0000      1      2  113781  151.5500  C22 C26        S  NaN
...      ...      ...    ...    ...     ...       ...      ...      ...  ...
1304  female  14.5000      1      0    2665   14.4542      NaN        C  NaN
1305  female      NaN      1      0    2665   14.4542      NaN        C  NaN
1306    male  26.5000      0      0    2656    7.2250      NaN        C  NaN
1307    male  27.0000      0      0    2670    7.2250      NaN        C  NaN
1308    male  29.0000      0      0  315082    7.8750      NaN        S  NaN

       body                        home.dest
0       NaN                     St Louis, MO
1       NaN  Montreal, PQ / Chesterville, ON
2       NaN  Montreal, PQ / Chesterville, ON
3     135.0  Montreal, PQ / Chesterville, ON
4       NaN  Montreal, PQ / Chesterville, ON
...     ...                              ...
1304  328.0                              NaN
1305    NaN                              NaN
1306  304.0                              NaN
1307    NaN                              NaN
1308    NaN                              NaN

[1309 rows x 14 columns]

In [9]:
df3.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"

In [12]:
df3.shape

(1309, 14)

In [13]:
df3.describe()

,pclass,survived,age,sibsp,parch,fare,body
count,1309.000000,1309.000000,1046.000000,1309.000000,1309.000000,1308.000000,121.000000
mean,2.294882,0.381971,29.881135,0.498854,0.385027,33.295479,160.809917
std,0.837836,0.486055,14.413500,1.041658,0.865560,51.758668,97.696922
min,1.000000,0.000000,0.166700,0.000000,0.000000,0.000000,1.000000
25%,2.000000,0.000000,21.000000,0.000000,0.000000,7.895800,72.000000
50%,3.000000,0.000000,28.000000,0.000000,0.000000,14.454200,155.000000
75%,3.000000,1.000000,39.000000,1.000000,0.000000,31.275000,256.000000
max,3.000000,1.000000,80.000000,8.000000,9.000000,512.329200,328.000000

In [15]:
df3.embarked.value_counts()

S    914
C    270
Q    123
Name: embarked, dtype: int64

In [17]:
df3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1309 entries, 0 to 1308
Data columns (total 14 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   pclass     1309 non-null   int64
 1   survived   1309 non-null   int64
 2   name       1309 non-null   object
 3   sex        1309 non-null   object
 4   age        1046 non-null   float64
 5   sibsp      1309 non-null   int64
 6   parch      1309 non-null   int64
 7   ticket     1309 non-null   object
 8   fare       1308 non-null   float64
 9   cabin      295 non-null    object
 10  embarked   1307 non-null   object
 11  boat       486 non-null    object
 12  body       121 non-null    float64
 13  home.dest  745 non-null    object
dtypes: float64(3), int64(4), object(7)
memory usage: 143.3+ KB

In [18]:
df3.embarked.value_counts(dropna=False) #to see the number of missing values as well

S      914
C      270
Q      123
NaN      2
Name: embarked, dtype: int64

In [29]:
df3.loc[ (df3.sex == "female") & (df3.age>40), ["age", "name"]]

       age                                              name
6     63.0                 Andrews, Miss. Kornelia Theodosia
8     53.0     Appleton, Mrs. Edward Dale (Charlotte Lamson)
17    50.0   Baxter, Mrs. James (Helene DeLaudeniere Chaput)
21    47.0  Beckwith, Mrs. Richard Leonard (Sallie Monypeny)
23    42.0                             Bidois, Miss. Rosalie
...    ...                                               ...
1153  47.0    Robins, Mrs. Alexander A (Grace Charity Laury)
1158  41.0          Rosblom, Mrs. Viktor (Helena Wilhelmina)
1211  45.0   Skoog, Mrs. William (Anna Bernhardina Karlsson)
1261  63.0                            Turkula, Mrs. (Hedwig)
1290  47.0                  Wilkes, Mrs. James (Ellen Needs)

[78 rows x 2 columns]

In [31]:
df3.loc[ (df3.sex == "female") & (df3.age.isna()), ["age", "name"]] #returns all the females that has age as blank(null)

      age                                               name
59    NaN  Cassebeer, Mrs. Henry Arthur Jr (Eleanor Genev...
69    NaN             Chibnall, Mrs. (Edith Martha Bowerman)
107   NaN               Flegenheim, Mrs. Alfred (Antoinette)
108   NaN                            Fleming, Miss. Margaret
121   NaN  Frauenthal, Mrs. Henry William (Clara Heinshei...
...   ...                                                ...
1180  NaN                     Sage, Mrs. John (Annie Bullen)
1198  NaN                         Shine, Miss. Ellen Natalia
1216  NaN                                 Smyth, Miss. Julia
1247  NaN  Thorneycroft, Mrs. Percival (Florence Kate White)
1305  NaN                              Zabour, Miss. Thamine

[78 rows x 2 columns]

In [32]:
df3.age.isna().sum() #taking the sum of all the blank values

263